
## Plan Result

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3120462974)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecr_repository.memo-board-rs
  * aws_iam_policy.memo_board_cd1
  * aws_iam_role.memo_board_cd
  * aws_iam_role_policy_attachment.memo_board_cd1


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.aws_iam_policy_document.memo_board_cd1 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "memo_board_cd1" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ecr:BatchCheckLayerAvailability",
              + "ecr:BatchGetImage",
              + "ecr:CompleteLayerUpload",
              + "ecr:GetDownloadUrlForLayer",
              + "ecr:InitiateLayerUpload",
              + "ecr:PutImage",
              + "ecr:UploadLayerPart",
            ]
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowPushPull"
        }
    }

  # aws_ecr_repository.memo-board-rs will be created
  + resource "aws_ecr_repository" "memo-board-rs" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "memo-board-rs"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_iam_policy.memo_board_cd1 will be created
  + resource "aws_iam_policy" "memo_board_cd1" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "memo_board_cd1"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.memo_board_cd will be created
  + resource "aws_iam_role" "memo_board_cd" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + "ForAnyValue:StringEquals" = {
                              + "token.actions.githubusercontent.com:sub" = "repo:hiyoko3m/memo-board:ref:refs/heads/main"
                            }
                          + StringEquals               = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "memo-board-cd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.memo_board_cd1 will be created
  + resource "aws_iam_role_policy_attachment" "memo_board_cd1" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "memo-board-cd"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":10,"Program":"tfcmt","SHA1":"38c3777dc2cc14c997252e93e061e6abd56e4db2","Vars":{},"WorkflowName":"Terraform"} -->